{
    "documents": [
      {
        "id": "doc-001",
        "title": "Product Overview - AI Chatbot Widget",
        "content": "Our AI Chatbot Widget is a cutting-edge solution that combines real-time voice capabilities with advanced text processing. It supports multiple LLM providers including GPT, Gemini, Claude, Grok, and DeepSeek. The widget features seamless voice interactions through OpenAI and Eleven Labs APIs, making conversations feel natural and engaging.",
        "category": "product",
        "tags": ["overview", "features", "voice", "text", "LLM"],
        "metadata": {
          "author": "Product Team",
          "lastUpdated": "2024-01-15",
          "version": "1.0"
        }
      },
      {
        "id": "doc-002",
        "title": "Voice Integration Features",
        "content": "The voice integration supports real-time speech-to-text and text-to-speech capabilities. Users can switch between OpenAI's Whisper API and Eleven Labs for optimal voice quality. The system includes automatic voice activity detection, noise cancellation, and support for multiple languages. Speech rate and voice styles can be customized to match user preferences.",
        "category": "features",
        "tags": ["voice", "speech", "audio", "real-time", "TTS", "STT"],
        "metadata": {
          "author": "Engineering Team",
          "lastUpdated": "2024-01-10"
        }
      },
      {
        "id": "doc-003",
        "title": "RAG Implementation",
        "content": "Our Retrieval-Augmented Generation (RAG) system enhances AI responses by retrieving relevant information from your knowledge base. It uses semantic search to find the most relevant documents, then provides them as context to the LLM. This ensures accurate, contextual responses based on your specific data. The system supports JSON, CSV, and text file formats.",
        "category": "technical",
        "tags": ["RAG", "retrieval", "search", "context", "accuracy"],
        "metadata": {
          "author": "AI Team",
          "lastUpdated": "2024-01-12"
        }
      },
      {
        "id": "doc-004",
        "title": "Embedding Instructions",
        "content": "To embed the widget on your website, simply copy the provided script tag and paste it before the closing body tag of your HTML. The widget automatically initializes and can be customized through the configuration object. It supports popup, inline, and fullscreen modes. The widget is responsive and works on all modern browsers including Chrome, Firefox, Safari, and Edge.",
        "category": "documentation",
        "tags": ["embedding", "installation", "setup", "configuration"],
        "metadata": {
          "author": "Documentation Team",
          "lastUpdated": "2024-01-08"
        }
      },
      {
        "id": "doc-005",
        "title": "Security and Privacy",
        "content": "All conversations are encrypted using industry-standard TLS encryption. We do not store personal data unless explicitly configured. The widget operates in a sandboxed environment when embedded via iframe. API keys are never exposed to the client-side code. We comply with GDPR, CCPA, and other privacy regulations.",
        "category": "security",
        "tags": ["security", "privacy", "encryption", "compliance", "GDPR"],
        "metadata": {
          "author": "Security Team",
          "lastUpdated": "2024-01-14"
        }
      },
      {
        "id": "doc-006",
        "title": "Customization Options",
        "content": "The widget offers extensive customization options including theme selection (light, dark, custom), color schemes, fonts, and border radius. You can customize the bot's name, avatar, welcome message, and placeholder text. Advanced options include temperature control for AI responses, max token limits, and speech rate adjustments.",
        "category": "customization",
        "tags": ["customization", "themes", "styling", "configuration"],
        "metadata": {
          "author": "Design Team",
          "lastUpdated": "2024-01-11"
        }
      },
      {
        "id": "doc-007",
        "title": "Performance Optimization",
        "content": "The widget is optimized for performance with lazy loading, code splitting, and efficient state management. It uses WebSockets for real-time communication, reducing latency. The bundle size is kept minimal through tree-shaking and compression. Response streaming is supported for faster perceived performance.",
        "category": "technical",
        "tags": ["performance", "optimization", "speed", "efficiency"],
        "metadata": {
          "author": "Engineering Team",
          "lastUpdated": "2024-01-13"
        }
      },
      {
        "id": "doc-008",
        "title": "Multi-Language Support",
        "content": "The chatbot supports over 50 languages for both text and voice interactions. Language detection is automatic but can be manually configured. The UI can be localized to match your website's language. RTL languages like Arabic and Hebrew are fully supported with proper text direction.",
        "category": "features",
        "tags": ["languages", "localization", "i18n", "multilingual"],
        "metadata": {
          "author": "Localization Team",
          "lastUpdated": "2024-01-09"
        }
      },
      {
        "id": "doc-009",
        "title": "Analytics and Insights",
        "content": "Track conversation metrics including total conversations, average response time, user satisfaction, and most common queries. The dashboard provides real-time analytics and historical trends. Export data in CSV or JSON format for further analysis. Integration with Google Analytics and other platforms is supported.",
        "category": "analytics",
        "tags": ["analytics", "metrics", "insights", "tracking", "dashboard"],
        "metadata": {
          "author": "Analytics Team",
          "lastUpdated": "2024-01-07"
        }
      },
      {
        "id": "doc-010",
        "title": "API Integration",
        "content": "The widget can be integrated with any backend API through webhooks and REST endpoints. It supports authentication via API keys, OAuth, and JWT tokens. Custom actions can be triggered based on user interactions. The system includes retry logic and error handling for robust API communication.",
        "category": "integration",
        "tags": ["API", "integration", "webhooks", "REST", "authentication"],
        "metadata": {
          "author": "Integration Team",
          "lastUpdated": "2024-01-06"
        }
      }
    ]
  }